       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. hello.                                               
       ENVIRONMENT DIVISION.                                           
       DATA DIVISION.                                                   
       PROCEDURE DIVISION.                                           
           DISPLAY 'HELLO WORLD'.                                       
           DISPLAY 'THIS IS POPUP'.
           STOP RUN.                                                    
